# 初学者向けPandas100本ノックver1.0.6
##### Shift + Enter で各セルのコードが実行されます
・print(ans[ 問題番号 ]) で回答コード例を表示  
・Python3エンジニア認定データ分析試験にも沿った問題内容   
・Pandasの各メソッドの説明は以下のサイトが分かりやすいです  
 　[note.nknk.me](https://note.nkmk.me/pandas/)  
・"Data for Titanic passengers" from [VANDERBILT UNIVERSITY](https://biostat.app.vumc.org/wiki/Main/DataSets)  
  
作成日:2020年9月24日  
最終更新日:2021年9月26日  
再配布・改編不可  
作成者：[kunishou](https://qiita.com/kunishou)

In [1]:
# Shift + Enterで題材データ、回答コードを読み込んで下さい

import pandas as pd
import glob

#題材データをdfに読み込み(タイタニック号の乗客データ、テストの点数データ 等)
def initialize1():
    df = pd.read_csv('../input/titanic3.csv')
    return df

def initialize2():
    df = pd.read_csv('../input/data1.csv')
    return df

df = initialize1()
df2 = initialize2()
df3 = pd.read_csv('../input/data1_2.csv')
df4 = pd.read_csv('../input/data1_3.csv')
df5 = pd.read_csv('../input/data2.csv',encoding='cp932')

#回答コードをansリストに格納
path = sorted(glob.glob('../input/a_' + '*.txt'))

ans = []

for _ in range(len(path)):
    with open(path[_], 'r',encoding='utf-8') as f:
        ans.append(f.read())

print(ans[0])

[answer0]

このように回答コード例がここに表示されます。
各問題の回答コード例を表示するときはprintの前の
#を消して実行して下さい。

コード例をセル内にコピー&ペーストし
実行すると、正解のデータが表示されます

# Pandas基礎 (1 - 13)

In [3]:
# 【1】
# dfに読み込んだデータの最初の5行を表示
#print(ans[1]) #回答表示
df = initialize1() #初期化

df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [5]:
# 【2】
# dfに読み込んだデータの最後の5行を表示
# print(ans[2]) #回答表示
df = initialize1() #初期化

df.tail()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [10]:
# 【3】
# dfのDataFrameサイズを確認
# print(ans[3]) #回答表示
df = initialize1() #初期化

df.shape

[answer3]

df.shape

(1309, 14)

In [13]:
# 【4】
# inputフォルダ内のdata1.csvファイルを
# 読み込みdf2に格納して、最初の5行を表示
# print(ans[4]) #回答表示

df2 = pd.read_csv("../input/data1.csv")
df2.head()

  name  class  English  Mathematics  History
0    A      1       80           55       65
1    B      1       55          100       83
2    C      2       65           70       95
3    D      1       40           63       70
4    E      2       76           82       79

In [2]:
# 【5】
# dfのfareの列で昇順に並び替えて表示
#print(ans[5]) #回答表示
df = initialize1() #初期化

df_sort = df.sort_values('fare')
print(df_sort)

      pclass  survived                                               name  \
363        2         0                              Campbell, Mr. William
223        1         0                      Parr, Mr. William Henry Marsh
170        1         1                            Ismay, Mr. Joseph Bruce
1254       3         1                       Tornquist, Mr. William Henry
896        3         0                                Johnson, Mr. Alfred
898        3         0                    Johnson, Mr. William Cahoone Jr
70         1         0              Chisholm, Mr. Roderick Robert Crispin
384        2         0                     Cunningham, Mr. Alfred Fleming
581        2         0                         Watson, Mr. Ennis Hastings
150        1         0                              Harrison, Mr. William
234        1         0                    Reuchlin, Jonkheer. John George
7          1         0                             Andrews, Mr. Thomas Jr
528        2         0                        Parkes, Mr. Francis "Frank"
473        2         0                               Knight, Mr. Robert J
410        2         0                   Frost, Mr. Anthony Wood "Archie"
963        3         0                                Leonard, Mr. Lionel
125        1         0                                   Fry, Mr. Richard
1082       3         1                          Olsen, Master. Artur Karl
673        3         0                                Betros, Mr. Tannous
51         1         0                           Carlsson, Mr. Frans Olof
1068       3         0                          Nysveen, Mr. Johan Hansen
1242       3         0                                   Thomas, Mr. John
1241       3         0                              Thomas, Mr. Charles P
960        3         0                         Lemberopolous, Mr. Peter L
868        3         0                   Holm, Mr. John Fredrik Alexander
1288       3         0                          Wiklund, Mr. Jakob Alfred
1289       3         0                            Wiklund, Mr. Karl Johan
888        3         0                         Johanson, Mr. Jakob Alfred
694        3         0                                Burke, Mr. Jeremiah
859        3         0                       Hegarty, Miss. Hanora "Nora"
...      ...       ...                                                ...
24         1         1                                  Bird, Miss. Ellen
285        1         0                                 Straus, Mr. Isidor
286        1         0             Straus, Mrs. Isidor (Rosalie Ida Blun)
106        1         0                                 Farthing, Mr. John
10         1         0                             Astor, Col. John Jacob
11         1         1  Astor, Mrs. John Jacob (Madeleine Talmadge Force)
23         1         1                              Bidois, Miss. Rosalie
237        1         0                                Robbins, Mr. Victor
103        1         1                      Endres, Miss. Caroline Louise
97         1         1  Douglas, Mrs. Frederick Charles (Mary Helene B...
17         1         1    Baxter, Mrs. James (Helene DeLaudeniere Chaput)
16         1         0                           Baxter, Mr. Quigg Edmond
35         1         1                           Bowen, Miss. Grace Scott
66         1         1                        Chaudanson, Miss. Victorine
253        1         1    Ryerson, Mrs. Arthur Larned (Emily Maria Borie)
252        1         0                         Ryerson, Mr. Arthur Larned
251        1         1              Ryerson, Miss. Susan Parker "Suzette"
250        1         1                         Ryerson, Miss. Emily Borie
249        1         1                        Ryerson, Master. John Borie
112        1         1                         Fortune, Miss. Ethel Flora
113        1         1                         Fortune, Miss. Mabel Helen
114        1         0                     Fortune, Mr. Charles Alexander
115        1         0                                  Fortune, Mr. Mark
111        1         1                     Fortune, Miss. Alice Elizabeth
116        1         1                Fortune, Mrs. Mark (Mary McDougald)
302        1         1                                   Ward, Miss. Anna
50         1         1  Cardeza, Mrs. James Warburton Martinez (Charlo...
49         1         1                 Cardeza, Mr. Thomas Drake Martinez
183        1         1                             Lesurer, Mr. Gustave J
1225       3         0                                 Storey, Mr. Thomas

         sex   age  sibsp  parch    ticket      fare            cabin  \
363     male   NaN      0      0    239853    0.0000              NaN
223     male   NaN      0      0    112052    0.0000              NaN
170     male  49.0      0      0    112058    0.0000      B52 B54 B56
1254    male  25.0      0      0      LINE    0.0000              NaN
896     male  49.0      0      0      LINE    0.0000              NaN
898     male  19.0      0      0      LINE    0.0000              NaN
70      male   NaN      0      0    112051    0.0000              NaN
384     male   NaN      0      0    239853    0.0000              NaN
581     male   NaN      0      0    239856    0.0000              NaN
150     male  40.0      0      0    112059    0.0000              B94
234     male  38.0      0      0     19972    0.0000              NaN
7       male  39.0      0      0    112050    0.0000              A36
528     male   NaN      0      0    239853    0.0000              NaN
473     male   NaN      0      0    239855    0.0000              NaN
410     male   NaN      0      0    239854    0.0000              NaN
963     male  36.0      0      0      LINE    0.0000              NaN
125     male   NaN      0      0    112058    0.0000             B102
1082    male   9.0      0      1   C 17368    3.1708              NaN
673     male  20.0      0      0      2648    4.0125              NaN
51      male  33.0      0      0       695    5.0000      B51 B53 B55
1068    male  61.0      0      0    345364    6.2375              NaN
1242    male   NaN      0      0      2681    6.4375              NaN
1241    male   NaN      1      0      2621    6.4375              NaN
960     male  34.5      0      0      2683    6.4375              NaN
868     male  43.0      0      0    C 7075    6.4500              NaN
1288    male  18.0      1      0   3101267    6.4958              NaN
1289    male  21.0      1      0   3101266    6.4958              NaN
888     male  34.0      0      0   3101264    6.4958              NaN
694     male  19.0      0      0    365222    6.7500              NaN
859   female  18.0      0      0    365226    6.7500              NaN
...      ...   ...    ...    ...       ...       ...              ...
24    female  29.0      0      0  PC 17483  221.7792              C97
285     male  67.0      1      0  PC 17483  221.7792          C55 C57
286   female  63.0      1      0  PC 17483  221.7792          C55 C57
106     male   NaN      0      0  PC 17483  221.7792              C95
10      male  47.0      1      0  PC 17757  227.5250          C62 C64
11    female  18.0      1      0  PC 17757  227.5250          C62 C64
23    female  42.0      0      0  PC 17757  227.5250              NaN
237     male   NaN      0      0  PC 17757  227.5250              NaN
103   female  38.0      0      0  PC 17757  227.5250              C45
97    female  27.0      1      1  PC 17558  247.5208          B58 B60
17    female  50.0      0      1  PC 17558  247.5208          B58 B60
16      male  24.0      0      1  PC 17558  247.5208          B58 B60
35    female  45.0      0      0  PC 17608  262.3750              NaN
66    female  36.0      0      0  PC 17608  262.3750              B61
253   female  48.0      1      3  PC 17608  262.3750  B57 B59 B63 B66
252     male  61.0      1      3  PC 17608  262.3750  B57 B59 B63 B66
251   female  21.0      2      2  PC 17608  262.3750  B57 B59 B63 B66
250   female  18.0      2      2  PC 17608  262.3750  B57 B59 B63 B66
249     male  13.0      2      2  PC 17608  262.3750  B57 B59 B63 B66
112   female  28.0      3      2     19950  263.0000      C23 C25 C27
113   female  23.0      3      2     19950  263.0000      C23 C25 C27
114     male  19.0      3      2     19950  263.0000      C23 C25 C27
115     male  64.0      1      4     19950  263.0000      C23 C25 C27
111   female  24.0      3      2     19950  263.0000      C23 C25 C27
116   female  60.0      1      4     19950  263.0000      C23 C25 C27
302   female  35.0      0      0  PC 17755  512.3292              NaN
50    female  58.0      0      1  PC 17755  512.3292      B51 B53 B55
49      male  36.0      0      1  PC 17755  512.3292      B51 B53 B55
183     male  35.0      0      0  PC 17755  512.3292             B101
1225    male  60.5      0      0      3701       NaN              NaN

     embarked boat   body                                       home.dest
363         S  NaN    NaN                                         Belfast
223         S  NaN    NaN                                         Belfast
170         S    C    NaN                                       Liverpool
1254        S   15    NaN                                             NaN
896         S  NaN    NaN                                             NaN
898         S  NaN    NaN                                             NaN
70          S  NaN    NaN                    Liverpool, England / Belfast
384         S  NaN    NaN                                         Belfast
581         S  NaN    NaN                                         Belfast
150         S  NaN  110.0                                             NaN
234         S  NaN    NaN                          Rotterdam, Netherlands
7           S  NaN    NaN                                     Belfast, NI
528         S  NaN    NaN                                         Belfast
473         S  NaN    NaN                                         Belfast
410         S  NaN    NaN                                         Belfast
963         S  NaN    NaN                                             NaN
125         S  NaN    NaN                                             NaN
1082        S   13    NaN                                             NaN
673         C  NaN    NaN                                           Syria
51          S  NaN    NaN                                    New York, NY
1068        S  NaN    NaN                                             NaN
1242        C  NaN    NaN                                             NaN
1241        C  NaN    NaN                                             NaN
960         C  NaN  196.0                                             NaN
868         S  NaN    NaN                                             NaN
1288        S  NaN  314.0                                             NaN
1289        S  NaN    NaN                                             NaN
888         S  NaN  143.0                                             NaN
694         Q  NaN    NaN                Co Cork, Ireland Charlestown, MA
859         Q  NaN    NaN                                             NaN
...       ...  ...    ...                                             ...
24          S    8    NaN                                             NaN
285         S  NaN   96.0                                    New York, NY
286         S  NaN    NaN                                    New York, NY
106         S  NaN    NaN                                             NaN
10          C  NaN  124.0                                    New York, NY
11          C    4    NaN                                    New York, NY
23          C    4    NaN                                             NaN
237         C  NaN    NaN                                             NaN
103         C    4    NaN                                    New York, NY
97          C    6    NaN                                    Montreal, PQ
17          C    6    NaN                                    Montreal, PQ
16          C  NaN    NaN                                    Montreal, PQ
35          C    4    NaN                                 Cooperstown, NY
66          C    4    NaN                                             NaN
253         C    4    NaN                 Haverford, PA / Cooperstown, NY
252         C  NaN    NaN                 Haverford, PA / Cooperstown, NY
251         C    4    NaN                 Haverford, PA / Cooperstown, NY
250         C    4    NaN                 Haverford, PA / Cooperstown, NY
249         C    4    NaN                 Haverford, PA / Cooperstown, NY
112         S   10    NaN                                    Winnipeg, MB
113         S   10    NaN                                    Winnipeg, MB
114         S  NaN    NaN                                    Winnipeg, MB
115         S  NaN    NaN                                    Winnipeg, MB
111         S   10    NaN                                    Winnipeg, MB
116         S   10    NaN                                    Winnipeg, MB
302         C    3    NaN                                             NaN
50          C    3    NaN                    Germantown, Philadelphia, PA
49          C    3    NaN  Austria-Hungary / Germantown, Philadelphia, PA
183         C    3    NaN                                             NaN
1225        S  NaN  261.0                                             NaN

[1309 rows x 14 columns]

In [3]:
# 【6】
# df_copyにdfをコピーして、最初の5行を表示
#print(ans[6]) #回答表示
df = initialize1() #初期化

df_copy = df
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [6]:
# 【7】
# ① dfの各列のデータ型を確認
# ② dfのcabinの列のデータ型を確認
#print(ans[7]) #回答表示
df = initialize1() #初期化

print(df.dtypes)
print(df["cabin"].dtype)

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object
object

In [8]:
# 【8】
# ① dfのpclassの列のデータ型をdtypeで確認
# ② 数値型から文字型に変換し、データ型をdtypeで確認
# print(ans[8]) #回答表示
df = initialize1() #初期化

print(df["pclass"].dtype)
df_copy = df.astype({"pclass": str})
print(df_copy["pclass"].dtype)

int64
object

In [11]:
# 【9】
# dfのレコード数(行数)を確認
# print(ans[9]) #回答表示
df = initialize1() #初期化

len(df)

1309

In [14]:
# 【10】
# dfのレコード数(行数)、各列のデータ型、欠損値の有無を確認
# print(ans[10]) #回答表示
df = initialize1() #初期化

df.info()
"""
# 誤答
print(len(df))
print(df.dtypes)
print(df.isnull().all())
"""

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
pclass       1309 non-null int64
survived     1309 non-null int64
name         1309 non-null object
sex          1309 non-null object
age          1046 non-null float64
sibsp        1309 non-null int64
parch        1309 non-null int64
ticket       1309 non-null object
fare         1308 non-null float64
cabin        295 non-null object
embarked     1307 non-null object
boat         486 non-null object
body         121 non-null float64
home.dest    745 non-null object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.2+ KB

'\n# 誤答\nprint(len(df))\nprint(df.dtypes)\nprint(df.isnull().all())\n'

In [16]:
# 【11】
# dfのsex,cabinの列の要素を確認
# print(ans[11]) #回答表示
df = initialize1() #初期化


print(df["sex"].unique())
print(df["cabin"].unique())

['female' 'male']
['B5' 'C22 C26' 'E12' 'D7' 'A36' 'C101' nan 'C62 C64' 'B35' 'A23'
 'B58 B60' 'D15' 'C6' 'D35' 'C148' 'C97' 'B49' 'C99' 'C52' 'T' 'A31' 'C7'
 'C103' 'D22' 'E33' 'A21' 'B10' 'B4' 'E40' 'B38' 'E24' 'B51 B53 B55'
 'B96 B98' 'C46' 'E31' 'E8' 'B61' 'B77' 'A9' 'C89' 'A14' 'E58' 'E49' 'E52'
 'E45' 'B22' 'B26' 'C85' 'E17' 'B71' 'B20' 'A34' 'C86' 'A16' 'A20' 'A18'
 'C54' 'C45' 'D20' 'A29' 'C95' 'E25' 'C111' 'C23 C25 C27' 'E36' 'D34'
 'D40' 'B39' 'B41' 'B102' 'C123' 'E63' 'C130' 'B86' 'C92' 'A5' 'C51' 'B42'
 'C91' 'C125' 'D10 D12' 'B82 B84' 'E50' 'D33' 'C83' 'B94' 'D49' 'D45'
 'B69' 'B11' 'E46' 'C39' 'B18' 'D11' 'C93' 'B28' 'C49' 'B52 B54 B56' 'E60'
 'C132' 'B37' 'D21' 'D19' 'C124' 'D17' 'B101' 'D28' 'D6' 'D9' 'B80' 'C106'
 'B79' 'C47' 'D30' 'C90' 'E38' 'C78' 'C30' 'C118' 'D36' 'D48' 'D47' 'C105'
 'B36' 'B30' 'D43' 'B24' 'C2' 'C65' 'B73' 'C104' 'C110' 'C50' 'B3' 'A24'
 'A32' 'A11' 'A10' 'B57 B59 B63 B66' 'C28' 'E44' 'A26' 'A6' 'A7' 'C31'
 'A19' 'B45' 'E34' 'B78' 'B50' 'C87' 'C116' 'C55 C57' 'D50' 'E68' 'E67'
 'C126' 'C68' 'C70' 'C53' 'B19' 'D46' 'D37' 'D26' 'C32' 'C80' 'C82' 'C128'
 'E39 E41' 'D' 'F4' 'D56' 'F33' 'E101' 'E77' 'F2' 'D38' 'F' 'F G63'
 'F E57' 'F E46' 'F G73' 'E121' 'F E69' 'E10' 'G6' 'F38']

In [20]:
# 【12】
# dfの列名一覧をlist形式で表示
# print(ans[12]) #回答表示
df = initialize1() #初期化

print(df.columns.tolist())

['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest']

In [22]:
# 【13】
# dfのインデックス一覧をndaaray形式で表示
# print(ans[13]) #回答表示
df = initialize1() #初期化#

print(df.columns.values)

['pclass' 'survived' 'name' 'sex' 'age' 'sibsp' 'parch' 'ticket' 'fare'
 'cabin' 'embarked' 'boat' 'body' 'home.dest']

# データ抽出 (14 - 32)

In [4]:
# 【14】
# dfのnameの列のみ表示
# print(ans[14]) #回答表示
df = initialize1() #初期化

print(df["name"])

[answer14]

df['name']
0                           Allen, Miss. Elisabeth Walton
1                          Allison, Master. Hudson Trevor
2                            Allison, Miss. Helen Loraine
3                    Allison, Mr. Hudson Joshua Creighton
4         Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
5                                     Anderson, Mr. Harry
6                       Andrews, Miss. Kornelia Theodosia
7                                  Andrews, Mr. Thomas Jr
8           Appleton, Mrs. Edward Dale (Charlotte Lamson)
9                                 Artagaveytia, Mr. Ramon
10                                 Astor, Col. John Jacob
11      Astor, Mrs. John Jacob (Madeleine Talmadge Force)
12                          Aubart, Mme. Leontine Pauline
13                           Barber, Miss. Ellen "Nellie"
14                   Barkworth, Mr. Algernon Henry Wilson
15                                    Baumann, Mr. John D
16                               Baxter, Mr. Quigg Edmond
17        Baxter, Mrs. James (Helene DeLaudeniere Chaput)
18                                  Bazzani, Miss. Albina
19                                   Beattie, Mr. Thomson
20                          Beckwith, Mr. Richard Leonard
21       Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
22                                  Behr, Mr. Karl Howell
23                                  Bidois, Miss. Rosalie
24                                      Bird, Miss. Ellen
25                                    Birnbaum, Mr. Jakob
26                                Bishop, Mr. Dickinson H
27                Bishop, Mrs. Dickinson H (Helen Walton)
28                                 Bissette, Miss. Amelia
29              Bjornstrom-Steffansson, Mr. Mauritz Hakan
                              ...
1279                 Vestrom, Miss. Hulda Amanda Adolfina
1280                                      Vovk, Mr. Janko
1281                                 Waelens, Mr. Achille
1282                                  Ware, Mr. Frederick
1283                          Warren, Mr. Charles William
1284                                    Webber, Mr. James
1285                                  Wenzel, Mr. Linhart
1286      Whabee, Mrs. George Joseph (Shawneene Abi-Saab)
1287                     Widegren, Mr. Carl/Charles Peter
1288                            Wiklund, Mr. Jakob Alfred
1289                              Wiklund, Mr. Karl Johan
1290                     Wilkes, Mrs. James (Ellen Needs)
1291                     Willer, Mr. Aaron ("Abi Weller")
1292                                   Willey, Mr. Edward
1293                    Williams, Mr. Howard Hugh "Harry"
1294                                 Williams, Mr. Leslie
1295                                  Windelov, Mr. Einar
1296                                     Wirz, Mr. Albert
1297                               Wiseman, Mr. Phillippe
1298                            Wittevrongel, Mr. Camille
1299                                  Yasbeck, Mr. Antoni
1300              Yasbeck, Mrs. Antoni (Selini Alexander)
1301                                 Youseff, Mr. Gerious
1302                                    Yousif, Mr. Wazli
1303                                Yousseff, Mr. Gerious
1304                                 Zabour, Miss. Hileni
1305                                Zabour, Miss. Thamine
1306                            Zakarian, Mr. Mapriededer
1307                                  Zakarian, Mr. Ortin
1308                                   Zimmerman, Mr. Leo
Name: name, Length: 1309, dtype: object

In [6]:
# 【15】
# dfのnameとsexの列のみ表示
# print(ans[15]) #回答表示
df = initialize1() #初期化

df[["name", "sex"]]

                                                   name     sex
0                         Allen, Miss. Elisabeth Walton  female
1                        Allison, Master. Hudson Trevor    male
2                          Allison, Miss. Helen Loraine  female
3                  Allison, Mr. Hudson Joshua Creighton    male
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female
5                                   Anderson, Mr. Harry    male
6                     Andrews, Miss. Kornelia Theodosia  female
7                                Andrews, Mr. Thomas Jr    male
8         Appleton, Mrs. Edward Dale (Charlotte Lamson)  female
9                               Artagaveytia, Mr. Ramon    male
10                               Astor, Col. John Jacob    male
11    Astor, Mrs. John Jacob (Madeleine Talmadge Force)  female
12                        Aubart, Mme. Leontine Pauline  female
13                         Barber, Miss. Ellen "Nellie"  female
14                 Barkworth, Mr. Algernon Henry Wilson    male
15                                  Baumann, Mr. John D    male
16                             Baxter, Mr. Quigg Edmond    male
17      Baxter, Mrs. James (Helene DeLaudeniere Chaput)  female
18                                Bazzani, Miss. Albina  female
19                                 Beattie, Mr. Thomson    male
20                        Beckwith, Mr. Richard Leonard    male
21     Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female
22                                Behr, Mr. Karl Howell    male
23                                Bidois, Miss. Rosalie  female
24                                    Bird, Miss. Ellen  female
25                                  Birnbaum, Mr. Jakob    male
26                              Bishop, Mr. Dickinson H    male
27              Bishop, Mrs. Dickinson H (Helen Walton)  female
28                               Bissette, Miss. Amelia  female
29            Bjornstrom-Steffansson, Mr. Mauritz Hakan    male
...                                                 ...     ...
1279               Vestrom, Miss. Hulda Amanda Adolfina  female
1280                                    Vovk, Mr. Janko    male
1281                               Waelens, Mr. Achille    male
1282                                Ware, Mr. Frederick    male
1283                        Warren, Mr. Charles William    male
1284                                  Webber, Mr. James    male
1285                                Wenzel, Mr. Linhart    male
1286    Whabee, Mrs. George Joseph (Shawneene Abi-Saab)  female
1287                   Widegren, Mr. Carl/Charles Peter    male
1288                          Wiklund, Mr. Jakob Alfred    male
1289                            Wiklund, Mr. Karl Johan    male
1290                   Wilkes, Mrs. James (Ellen Needs)  female
1291                   Willer, Mr. Aaron ("Abi Weller")    male
1292                                 Willey, Mr. Edward    male
1293                  Williams, Mr. Howard Hugh "Harry"    male
1294                               Williams, Mr. Leslie    male
1295                                Windelov, Mr. Einar    male
1296                                   Wirz, Mr. Albert    male
1297                             Wiseman, Mr. Phillippe    male
1298                          Wittevrongel, Mr. Camille    male
1299                                Yasbeck, Mr. Antoni    male
1300            Yasbeck, Mrs. Antoni (Selini Alexander)  female
1301                               Youseff, Mr. Gerious    male
1302                                  Yousif, Mr. Wazli    male
1303                              Yousseff, Mr. Gerious    male
1304                               Zabour, Miss. Hileni  female
1305                              Zabour, Miss. Thamine  female
1306                          Zakarian, Mr. Mapriededer    male
1307                                Zakarian, Mr. Ortin    male
1308                                 Zimmerman, Mr. Leo    male

[1309 rows x 2 columns]

In [7]:
# 【16】
# dfのindex(行)の4行目までを表示
#print(ans[16]) #回答表示
df = initialize1() #初期化

df[:4]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"

In [11]:
# 【17】
# dfのindex(行)の4行目から10行目までを表示
# print(ans[17]) #回答表示
df = initialize1() #初期化

df[3: 10]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"

In [14]:
# 【18】
# locを使ってdf全体を表示
# print(ans[18]) #回答表示
df = initialize1() #初期化

df.loc[:, :]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.00,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.00,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.00,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.00,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.00,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"
10,1,0,"Astor, Col. John Jacob",male,47.00,1,0,PC 17757,227.5250,C62 C64,C,NaN,124.0,"New York, NY"
11,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.00,1,0,PC 17757,227.5250,C62 C64,C,4,NaN,"New York, NY"
12,1,1,"Aubart, Mme. Leontine Pauline",female,24.00,0,0,PC 17477,69.3000,B35,C,9,NaN,"Paris, France"
13,1,1,"Barber, Miss. Ellen ""Nellie""",female,26.00,0,0,19877,78.8500,NaN,S,6,NaN,NaN
14,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.00,0,0,27042,30.0000,A23,S,B,NaN,"Hessle, Yorks"
15,1,0,"Baumann, Mr. John D",male,NaN,0,0,PC 17318,25.9250,NaN,S,NaN,NaN,"New York, NY"
16,1,0,"Baxter, Mr. Quigg Edmond",male,24.00,0,1,PC 17558,247.5208,B58 B60,C,NaN,NaN,"Montreal, PQ"
17,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.00,0,1,PC 17558,247.5208,B58 B60,C,6,NaN,"Montreal, PQ"
18,1,1,"Bazzani, Miss. Albina",female,32.00,0,0,11813,76.2917,D15,C,8,NaN,NaN
19,1,0,"Beattie, Mr. Thomson",male,36.00,0,0,13050,75.2417,C6,C,A,NaN,"Winnipeg, MN"
20,1,1,"Beckwith, Mr. Richard Leonard",male,37.00,1,1,11751,52.5542,D35,S,5,NaN,"New York, NY"
21,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.00,1,1,11751,52.5542,D35,S,5,NaN,"New York, NY"
22,1,1,"Behr, Mr. Karl Howell",male,26.00,0,0,111369,30.0000,C148,C,5,NaN,"New York, NY"
23,1,1,"Bidois, Miss. Rosalie",female,42.00,0,0,PC 17757,227.5250,NaN,C,4,NaN,NaN
24,1,1,"Bird, Miss. Ellen",female,29.00,0,0,PC 17483,221.7792,C97,S,8,NaN,NaN
25,1,0,"Birnbaum, Mr. Jakob",male,25.00,0,0,13905,26.0000,NaN,C,NaN,148.0,"San Francisco, CA"
26,1,1,"Bishop, Mr. Dickinson H",male,25.00,1,0,11967,91.0792,B49,C,7,NaN,"Dowagiac, MI"
27,1,1,"Bishop, Mrs. Dickinson H (Helen Walton)",female,19.00,1,0,11967,91.0792,B49,C,7,NaN,"Dowagiac, MI"
28,1,1,"Bissette, Miss. Amelia",female,35.00,0,0,PC 17760,135.6333,C99,S,8,NaN,NaN
29,1,1,"Bjornstrom-Steffansson, Mr. Mauritz Hakan",male,28.00,0,0,110564,26.5500,C52,S,D,NaN,"Stockholm, Sweden / Washington, DC"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1279,3,0,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.00,0,0,350406,7.8542,NaN,S,NaN,NaN,NaN
1280,3,0,"Vovk, Mr. Janko",male,22.00,0,0,349252,7.8958,NaN,S,NaN,NaN,NaN
1281,3,0,"Waelens, Mr. Achille",male,22.00,0,0,345767,9.0000,NaN,S,NaN,NaN,"Antwerp, Belgium / Stanton, OH"
1282,3,0,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S,NaN,NaN,NaN
1283,3,0,"Warren, Mr. Charles William",male,NaN,0,0,C.A. 49867,7.5500,NaN,S,NaN,NaN,NaN
1284,3,0,"Webber, Mr. James",male,NaN,0,0,SOTON/OQ 3101316,8.0500,NaN,S,NaN,NaN,NaN
1285,3,0,"Wenzel, Mr. Linhart",male,32.50,0,0,345775,9.5000,NaN,S,NaN,298.0,NaN
1286,3,1,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.00,0,0,2688,7.2292,NaN,C,C,NaN,NaN
1287,3,0,"Widegren, Mr. Carl/Charles Peter",male,51.00,0,0,347064,7.7500,NaN,S,NaN,NaN,NaN
1288,3,0,"Wiklund, Mr. Jakob Alfred",male,18.00,1,0,3101267,6.4958,NaN,S,NaN,314.0,NaN
1289,3,0,"Wiklund, Mr. Karl Johan",male,21.00,1,0,3101266,6.4958,NaN,S,NaN,NaN,NaN
1290,3,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.00,1,0,363272,7.0000,NaN,S,NaN,NaN,NaN
1291,3,0,"Willer, Mr. Aaron (""Abi Weller"")",male,NaN,0,0,3410,8.7125,NaN,S,NaN,NaN,NaN
1292,3,0,"Willey, Mr. Edward",male,NaN,0,0,S.O./P.P. 751,7.5500,NaN,S,NaN,NaN,NaN
1293,3,0,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.0500,NaN,S,NaN,NaN,NaN
1294,3,0,"Williams, Mr. Leslie",male,28.50,0,0,54636,16.1000,NaN,S,NaN,14.0,NaN
1295,3,0,"Windelov, Mr. Einar",male,21.00,0,0,SOTON/OQ 3101317,7.2500,NaN,S,NaN,NaN,NaN
1296,3,0,"Wirz, Mr. Albert",male,27.00,0,0,315154,8.6625,NaN,S,NaN,131.0,NaN
1297,3,0,"Wiseman, Mr. Phillippe",male,NaN,0,0,A/4. 34244,7.2500,NaN,S,NaN,NaN,NaN
1298,3,0,"Wittevrongel, Mr. Camille",male,36.00,0,0,345771,9.5000,NaN,S,NaN,NaN,NaN
1299,3,0,"Yasbeck, Mr. Antoni",male,27.00,1,0,2659,14.4542,NaN,C,C,NaN,NaN
1300,3,1,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.00,1,0,2659,14.4542,NaN,C,NaN,NaN,NaN
1301,3,0,"Youseff, Mr. Gerious",male,45.50,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN
1302,3,0,"Yousif, Mr. Wazli",male,NaN,0,0,2647,7.2250,NaN,C,NaN,NaN,NaN
1303,3,0,"Yousseff, Mr. Gerious",male,NaN,0,0,2627,14.4583,NaN,C,NaN,NaN,NaN
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [15]:
# 【19】
# locを使ってdfのfare列をすべて表示
#print(ans[19]) #回答表示
df = initialize1() #初期化

df.loc[:, "fare"]

0       211.3375
1       151.5500
2       151.5500
3       151.5500
4       151.5500
5        26.5500
6        77.9583
7         0.0000
8        51.4792
9        49.5042
10      227.5250
11      227.5250
12       69.3000
13       78.8500
14       30.0000
15       25.9250
16      247.5208
17      247.5208
18       76.2917
19       75.2417
20       52.5542
21       52.5542
22       30.0000
23      227.5250
24      221.7792
25       26.0000
26       91.0792
27       91.0792
28      135.6333
29       26.5500
          ...
1279      7.8542
1280      7.8958
1281      9.0000
1282      8.0500
1283      7.5500
1284      8.0500
1285      9.5000
1286      7.2292
1287      7.7500
1288      6.4958
1289      6.4958
1290      7.0000
1291      8.7125
1292      7.5500
1293      8.0500
1294     16.1000
1295      7.2500
1296      8.6625
1297      7.2500
1298      9.5000
1299     14.4542
1300     14.4542
1301      7.2250
1302      7.2250
1303     14.4583
1304     14.4542
1305     14.4542
1306      7.2250
1307      7.2250
1308      7.8750
Name: fare, Length: 1309, dtype: float64

In [16]:
# 【20】
# locを使ってdfのfare列の10のラベルまで表示
#print(ans[20]) #回答表示
df = initialize1() #初期化

df.loc[:10, "fare"]

0     211.3375
1     151.5500
2     151.5500
3     151.5500
4     151.5500
5      26.5500
6      77.9583
7       0.0000
8      51.4792
9      49.5042
10    227.5250
Name: fare, dtype: float64

In [6]:
# 【21】
# locを使ってdfのnameとticketの列をすべて表示
#print(ans[21]) #回答表示
df = initialize1() #初期化

df.loc[:, ["name", "ticket"]]

                                                 name  ticket
0                       Allen, Miss. Elisabeth Walton   24160
1                      Allison, Master. Hudson Trevor  113781
2                        Allison, Miss. Helen Loraine  113781
3                Allison, Mr. Hudson Joshua Creighton  113781
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  113781
...                                               ...     ...
1304                             Zabour, Miss. Hileni    2665
1305                            Zabour, Miss. Thamine    2665
1306                        Zakarian, Mr. Mapriededer    2656
1307                              Zakarian, Mr. Ortin    2670
1308                               Zimmerman, Mr. Leo  315082

[1309 rows x 2 columns]

In [8]:
# 【22】
# locを使ってdfのnameからcabinまでの列をすべて表示
#print(ans[22]) #回答表示
df = initialize1() #初期化

df.loc[:, "name":"cabin"]

,name,sex,age,sibsp,parch,ticket,fare,cabin
0,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5
1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26
2,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26
3,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26
4,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26
...,...,...,...,...,...,...,...,...
1304,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN
1305,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN
1306,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN
1307,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN
1308,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN

In [13]:
# 【23】
# ilocを使ってdfのage列を5行目まで表示
# print(ans[23]) #回答表示
df = initialize1() #初期化


df.iloc[:5]["age"]

[answer23]

df.iloc[:5,4]


[tips]
ilocは抽出する行、列を番号で指定

0    29.00
1     0.92
2     2.00
3    30.00
4    25.00
Name: age, dtype: float64

In [14]:
# 【24】
# dfのname,age,sexの列のみ抽出しdf_copyに格納
# その後outputフォルダにcsvファイルで出力
# 出力ファイル名はsample.csv
#print(ans[24]) #回答表示
df = initialize1() #初期化


df_copy = df.loc[:, ["name", "age", "sex"]]
df_copy.to_csv("sample.csv")

In [18]:
# 【25】
# dfのage列の値が30以上のデータのみ抽出
#print(ans[25]) #回答表示
df = initialize1() #初期化

df[df["age"] >= 30]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1286,3,1,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0,0,0,2688,7.2292,NaN,C,C,NaN,NaN
1287,3,0,"Widegren, Mr. Carl/Charles Peter",male,51.0,0,0,347064,7.7500,NaN,S,NaN,NaN,NaN
1290,3,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN,NaN,NaN
1298,3,0,"Wittevrongel, Mr. Camille",male,36.0,0,0,345771,9.5000,NaN,S,NaN,NaN,NaN
1301,3,0,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN

In [23]:
# 【26】
# dfのsex列がfemaleのデータのみ抽出
# print(ans[26]) #回答表示
df = initialize1() #初期化

df[df["sex"] == "female"]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1286,3,1,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0,0,0,2688,7.2292,NaN,C,C,NaN,NaN
1290,3,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN,NaN,NaN
1300,3,1,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.0,1,0,2659,14.4542,NaN,C,NaN,NaN,NaN
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN

In [26]:
# 【27】
# dfのsex列がfemaleでかつageが40以上のデータのみ抽出
#print(ans[27]) #回答表示
df = initialize1() #初期化

df[(df["sex"] == "female") & (df["age"] >= 40)]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
17,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,0,1,PC 17558,247.5208,B58 B60,C,6,NaN,"Montreal, PQ"
21,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S,5,NaN,"New York, NY"
23,1,1,"Bidois, Miss. Rosalie",female,42.0,0,0,PC 17757,227.5250,NaN,C,4,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1153,3,0,"Robins, Mrs. Alexander A (Grace Charity Laury)",female,47.0,1,0,A/5. 3337,14.5000,NaN,S,NaN,7.0,NaN
1158,3,0,"Rosblom, Mrs. Viktor (Helena Wilhelmina)",female,41.0,0,2,370129,20.2125,NaN,S,NaN,NaN,NaN
1211,3,0,"Skoog, Mrs. William (Anna Bernhardina Karlsson)",female,45.0,1,4,347088,27.9000,NaN,S,NaN,NaN,NaN
1261,3,1,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S,15,NaN,NaN
1290,3,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN,NaN,NaN

In [27]:
# 【28】
# queryを用いてdfのsex列がfemaleでかつageが40以上のデータのみ抽出
#print(ans[28]) #回答表示
df = initialize1() #初期化

df.query('sex=="female" and age >= 40')

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
17,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,0,1,PC 17558,247.5208,B58 B60,C,6,NaN,"Montreal, PQ"
21,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S,5,NaN,"New York, NY"
23,1,1,"Bidois, Miss. Rosalie",female,42.0,0,0,PC 17757,227.5250,NaN,C,4,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1153,3,0,"Robins, Mrs. Alexander A (Grace Charity Laury)",female,47.0,1,0,A/5. 3337,14.5000,NaN,S,NaN,7.0,NaN
1158,3,0,"Rosblom, Mrs. Viktor (Helena Wilhelmina)",female,41.0,0,2,370129,20.2125,NaN,S,NaN,NaN,NaN
1211,3,0,"Skoog, Mrs. William (Anna Bernhardina Karlsson)",female,45.0,1,4,347088,27.9000,NaN,S,NaN,NaN,NaN
1261,3,1,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S,15,NaN,NaN
1290,3,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN,NaN,NaN

In [31]:
# 【29】
# dfのname列に文字列「Mrs」が含まれるデータを表示
#print(ans[29]) #回答表示
df = initialize1() #初期化

df.query('name.str.contains("Mrs")', engine='python')

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
11,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.0,1,0,PC 17757,227.5250,C62 C64,C,4,NaN,"New York, NY"
17,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,0,1,PC 17558,247.5208,B58 B60,C,6,NaN,"Montreal, PQ"
21,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S,5,NaN,"New York, NY"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1267,3,0,"Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...",female,30.0,1,1,345773,24.1500,NaN,S,NaN,NaN,NaN
1276,3,0,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S,NaN,NaN,NaN
1286,3,1,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0,0,0,2688,7.2292,NaN,C,C,NaN,NaN
1290,3,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN,NaN,NaN
1300,3,1,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.0,1,0,2659,14.4542,NaN,C,NaN,NaN,NaN

In [35]:
# 【30】
# dfの中で文字列型の列のみを表示
# print(ans[30]) #回答表示
df = initialize1() #初期化

df.select_dtypes(include="object")

,name,sex,ticket,cabin,embarked,boat,home.dest
0,"Allen, Miss. Elisabeth Walton",female,24160,B5,S,2,"St Louis, MO"
1,"Allison, Master. Hudson Trevor",male,113781,C22 C26,S,11,"Montreal, PQ / Chesterville, ON"
2,"Allison, Miss. Helen Loraine",female,113781,C22 C26,S,NaN,"Montreal, PQ / Chesterville, ON"
3,"Allison, Mr. Hudson Joshua Creighton",male,113781,C22 C26,S,NaN,"Montreal, PQ / Chesterville, ON"
4,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,113781,C22 C26,S,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...
1304,"Zabour, Miss. Hileni",female,2665,NaN,C,NaN,NaN
1305,"Zabour, Miss. Thamine",female,2665,NaN,C,NaN,NaN
1306,"Zakarian, Mr. Mapriededer",male,2656,NaN,C,NaN,NaN
1307,"Zakarian, Mr. Ortin",male,2670,NaN,C,NaN,NaN
1308,"Zimmerman, Mr. Leo",male,315082,NaN,S,NaN,NaN

In [38]:
# 【31】
# dfの各列の要素数の確認
# print(ans[31]) #回答表示
df = initialize1() #初期化

df.nunique()

pclass          3
survived        2
name         1307
sex             2
age            98
sibsp           7
parch           8
ticket        929
fare          281
cabin         186
embarked        3
boat           27
body          121
home.dest     369
dtype: int64

In [41]:
# 【32】
# dfのembarked列の要素と出現回数の確認
# print(ans[32]) #回答表示
df = initialize1() #初期化

# df["embarked"].unique()
df['embarked'].value_counts()

S    914
C    270
Q    123
Name: embarked, dtype: int64

# データ加工 (33 - 58)

In [4]:
# 【33】
# dfのindex名が「3」のage列を
# 30から40に変更し、先頭の5行を表示
# print(ans[33]) #回答表示
df = initialize1() #初期化

df.loc[3, 'age'] = 40
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,40.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [8]:
# 【34】
# dfのsex列にてmale→0、femlae→1に
# 変更し、先頭の5行を表示
# print(ans[34]) #回答表示
df = initialize1() #初期化

df["sex"][df["sex"] == "male"] = 0
df["sex"][df["sex"] == "female"] = 1
df.head()

c:\Users\tmkhs\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys
c:\Users\tmkhs\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",1,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",0,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",1,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",0,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [11]:
# 【35】
# dfのfare列に100を足して、
# 先頭の5行を表示
#print(ans[35]) #回答表示
df = initialize1() #初期化

df["fare"] = df["fare"] + 100
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,311.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,251.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,251.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,251.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,251.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [13]:
# 【36】
# dfのfare列に2を掛けて、
# 先頭の5行を表示
#print(ans[36]) #回答表示
df = initialize1() #初期化

df["fare"] = df["fare"] * 2
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,422.675,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,303.100,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,303.100,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,303.100,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,303.100,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [16]:
# 【37】
# dfのfare列を小数点以下で丸めて、先頭の5行を表示
# print(ans[37]) #回答表示
df = initialize1() #初期化

df["fare"] = df["fare"].round()
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.0,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,152.0,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,152.0,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,152.0,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,152.0,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [17]:
# 【38】
# dfに列名「test」で値がすべて1の
# カラムを追加し、先頭の5行を表示
#print(ans[38]) #回答表示
df = initialize1() #初期化

df["test"] = 1
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,test
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",1
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",1
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",1
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1

In [20]:
# 【39】
# dfにcabinとembarkedの列を「_」で
# 結合した列を追加(列名は「test」)し、
# 先頭の5行を表示
# print(ans[39]) #回答表示
df = initialize1() #初期化

df["test"] = df["cabin"] + "_" + df["embarked"]
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,test
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",B5_S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",C22 C26_S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",C22 C26_S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",C22 C26_S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",C22 C26_S

In [24]:
# 【40】
# dfにageとembarkedの列を「_」で
# 結合した列を追加(列名は「test」)し、
# 先頭の5行を表示
# print(ans[40]) #回答表示
df = initialize1() #初期化

df["test"] = df["age"].astype(str) + "_" + df["embarked"]
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,test
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",29.0_S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",0.92_S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",2.0_S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",30.0_S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",25.0_S

In [26]:
# 【41】
# dfからbodyの列を削除し、最初の5行を表示
#print(ans[41]) #回答表示
df = initialize1() #初期化

df.drop(columns="body", inplace=True)
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,"Montreal, PQ / Chesterville, ON"

In [28]:
# 【42】
# dfからインデックス名「3」の行を削除し、最初の5行を表示
#print(ans[42]) #回答表示
df = initialize1() #初期化

df.drop(index=3, inplace=True)
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.00,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"

In [31]:
# 【43】
# df2の列名を'name', 'class', 'Biology', 'Physics', 'Chemistry'に変更
# df2の最初の5行を表示
#print(ans[43]) #回答表示
df2 = initialize2() #初期化

df2.set_axis(['name', 'class', 'Biology', 'Physics', 'Chemistry'], axis=1, inplace=True)
df2.head()

  name  class  Biology  Physics  Chemistry
0    A      1       80       55         65
1    B      1       55      100         83
2    C      2       65       70         95
3    D      1       40       63         70
4    E      2       76       82         79

In [33]:
# 【44】
# df2の列名を'English'をBiology'に変更
# df2の最初の5行を表示
#print(ans[44]) #回答表示
df2 = initialize2() #初期化

df2.rename(columns={"English": "Biology"}, inplace=True)
df2.head()

  name  class  Biology  Mathematics  History
0    A      1       80           55       65
1    B      1       55          100       83
2    C      2       65           70       95
3    D      1       40           63       70
4    E      2       76           82       79

In [34]:
# 【45】
# df2のインデックス名「1」を「10」に変更
# df2の最初の5行を表示
#print(ans[45]) #回答表示
df2 = initialize2() #初期化

df2.rename(index={1: 10}, inplace=True)
df2.head()

   name  class  English  Mathematics  History
0     A      1       80           55       65
10    B      1       55          100       83
2     C      2       65           70       95
3     D      1       40           63       70
4     E      2       76           82       79

In [37]:
# 【46】
# dfのすべての列の欠損値数を確認
# print(ans[46]) #回答表示
df = initialize1() #初期化

df.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [45]:
# 【47】
# dfのage列の欠損値に30を代入
# その後、ageの欠損値数を確認
# print(ans[47]) #回答表示
df = initialize1() #初期化

df["age"] = df["age"].fillna(30)
df.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age             0
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [47]:
# 【48】
# dfでひとつでも欠損値がある行を削除
# その後、dfの欠損値数を確認
#print(ans[48]) #回答表示
df = initialize1() #初期化

df = df.dropna()
df.isnull().sum()

pclass       0.0
survived     0.0
name         0.0
sex          0.0
age          0.0
sibsp        0.0
parch        0.0
ticket       0.0
fare         0.0
cabin        0.0
embarked     0.0
boat         0.0
body         0.0
home.dest    0.0
dtype: float64

In [51]:
# 【49】
# dfのsurvivedの列をndarray形式(配列)で表示
# print(ans[49]) #回答表示
df = initialize1() #初期化

df["survived"].values

array([1, 1, 0, ..., 0, 0, 0], dtype=int64)

In [52]:
# 【50】
# dfの行をシャッフルして表示
#print(ans[50]) #回答表示
df = initialize1() #初期化

df = df.sample(frac=1)
df

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1091,3,0,"Oreskovic, Miss. Marija",female,20.0,0,0,315096,8.6625,NaN,S,NaN,NaN,NaN
262,1,0,"Silvey, Mr. William Baird",male,50.0,1,0,13507,55.9000,E44,S,NaN,NaN,"Duluth, MN"
904,3,0,"Jonkoff, Mr. Lalio",male,23.0,0,0,349204,7.8958,NaN,S,NaN,NaN,NaN
143,1,1,"Harder, Mr. George Achilles",male,25.0,1,0,11765,55.4417,E50,C,5,NaN,"Brooklyn, NY"
949,3,1,"Lang, Mr. Fang",male,26.0,0,0,1601,56.4958,NaN,S,14,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1243,3,0,"Thomas, Mr. Tannous",male,NaN,0,0,2684,7.2250,NaN,C,NaN,NaN,NaN
1193,3,0,"Scanlan, Mr. James",male,NaN,0,0,36209,7.7250,NaN,Q,NaN,NaN,NaN
231,1,1,"Peuchen, Major. Arthur Godfrey",male,52.0,0,0,113786,30.5000,C104,S,6,NaN,"Toronto, ON"
1294,3,0,"Williams, Mr. Leslie",male,28.5,0,0,54636,16.1000,NaN,S,NaN,14.0,NaN
961,3,0,"Lennon, Miss. Mary",female,NaN,1,0,370371,15.5000,NaN,Q,NaN,NaN,NaN

In [54]:
# 【51】
# dfの行をシャッフルし、インデックスを振り直して表示
#print(ans[51]) #回答表示
df = initialize1() #初期化

df.sample(frac=1, ignore_index=True)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,3,0,"Panula, Master. Eino Viljami",male,1.0,4,1,3101295,39.6875,NaN,S,NaN,NaN,NaN
1,2,0,"Carbines, Mr. William",male,19.0,0,0,28424,13.0000,NaN,S,NaN,18.0,"St Ives, Cornwall / Calumet, MI"
2,3,0,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S,NaN,255.0,NaN
3,2,1,"Christy, Mrs. (Alice Frances)",female,45.0,0,2,237789,30.0000,NaN,S,12,NaN,London
4,1,0,"Weir, Col. John",male,60.0,0,0,113800,26.5500,NaN,S,NaN,NaN,"England Salt Lake City, Utah"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1,0,"Chisholm, Mr. Roderick Robert Crispin",male,NaN,0,0,112051,0.0000,NaN,S,NaN,NaN,"Liverpool, England / Belfast"
1305,1,0,"Clark, Mr. Walter Miller",male,27.0,1,0,13508,136.7792,C89,C,NaN,NaN,"Los Angeles, CA"
1306,3,0,"Chronopoulos, Mr. Demetrios",male,18.0,1,0,2680,14.4542,NaN,C,NaN,NaN,Greece
1307,3,0,"Peduzzi, Mr. Joseph",male,NaN,0,0,A/5 2817,8.0500,NaN,S,NaN,NaN,NaN
1308,1,0,"Sutton, Mr. Frederick",male,61.0,0,0,36963,32.3208,D50,S,NaN,46.0,"Haddenfield, NJ"

In [55]:
# 【52】
# ①df2の重複行数をカウント
# ②df2の重複行を削除し、df2を表示
#print(ans[52]) #回答表示
df2 = initialize2() #初期化

df.duplicated().sum()
df.drop_duplicates()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [57]:
# 【53】
# dfのnameの列をすべて大文字に変換し表示
# print(ans[53]) #回答表示
df = initialize1() #初期化

df["name"].str.upper()

0                         ALLEN, MISS. ELISABETH WALTON
1                        ALLISON, MASTER. HUDSON TREVOR
2                          ALLISON, MISS. HELEN LORAINE
3                  ALLISON, MR. HUDSON JOSHUA CREIGHTON
4       ALLISON, MRS. HUDSON J C (BESSIE WALDO DANIELS)
                             ...
1304                               ZABOUR, MISS. HILENI
1305                              ZABOUR, MISS. THAMINE
1306                          ZAKARIAN, MR. MAPRIEDEDER
1307                                ZAKARIAN, MR. ORTIN
1308                                 ZIMMERMAN, MR. LEO
Name: name, Length: 1309, dtype: object

In [58]:
# 【54】
# dfのnameの列をすべて小文字に変換し表示
#print(ans[54]) #回答表示
df = initialize1() #初期化

df["name"].str.lower()

0                         allen, miss. elisabeth walton
1                        allison, master. hudson trevor
2                          allison, miss. helen loraine
3                  allison, mr. hudson joshua creighton
4       allison, mrs. hudson j c (bessie waldo daniels)
                             ...
1304                               zabour, miss. hileni
1305                              zabour, miss. thamine
1306                          zakarian, mr. mapriededer
1307                                zakarian, mr. ortin
1308                                 zimmerman, mr. leo
Name: name, Length: 1309, dtype: object

In [61]:
# 【55】
# dfのsex列に含まれる「female」という単語を
# 「Python」に置換。その後、1行目の
# 「female」が「Python」に置き換わったことを確認
# print(ans[55]) #回答表示
df = initialize1() #初期化

df["sex"][df["sex"] == "female"] = "Python"
df.head()

c:\Users\tmkhs\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",Python,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",Python,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",Python,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [64]:
# 【56】
# dfのname列1行目の「Allen, Miss. Elisabeth Walton」の
# 「Elisabeth」を消去(import reをインポート)
# print(ans[56]) #回答表示
df = initialize1() #初期化

import re

df["name"][0] = re.sub("Elisabeth", "", df["name"][0])
df["name"][0]

c:\Users\tmkhs\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  if __name__ == '__main__':

'Allen, Miss.  Walton'

In [74]:
# 【57】
# df5の都道府県列と市区町村列を空白がないように
# 「_」で結合(新規列名は「test2」)し、先頭5行を表示
# ※df5の「test」列は通常通り結合した場合の結果
# print(ans[57]) #回答表示

df5["test2"] = df5["都道府県"].str.rstrip() + "_" + df5["市区町村"]
df5.head()

     都道府県 市区町村        test    test2
0  東京都　　　  千代田  東京都　　　_千代田  東京都_千代田
1  東京都　　　   新宿   東京都　　　_新宿   東京都_新宿
2  東京都　　　   墨田   東京都　　　_墨田   東京都_墨田
3  神奈川　　　   横浜   神奈川　　　_横浜   神奈川_横浜
4  神奈川　　　   川﨑   神奈川　　　_川﨑   神奈川_川﨑

In [75]:
# 【58】
# df2の行と列を入れ替えて表示
#print(ans[58]) #回答表示
df2 = initialize2() #初期化

df.T

,0,1,2,3,4,5,6,7,8,9,...,1299,1300,1301,1302,1303,1304,1305,1306,1307,1308
pclass,1,1,1,1,1,1,1,1,1,1,...,3,3,3,3,3,3,3,3,3,3
survived,1,1,0,0,0,1,1,0,1,0,...,0,1,0,0,0,0,0,0,0,0
name,"Allen, Miss. Walton","Allison, Master. Hudson Trevor","Allison, Miss. Helen Loraine","Allison, Mr. Hudson Joshua Creighton","Allison, Mrs. Hudson J C (Bessie Waldo Daniels)","Anderson, Mr. Harry","Andrews, Miss. Kornelia Theodosia","Andrews, Mr. Thomas Jr","Appleton, Mrs. Edward Dale (Charlotte Lamson)","Artagaveytia, Mr. Ramon",...,"Yasbeck, Mr. Antoni","Yasbeck, Mrs. Antoni (Selini Alexander)","Youseff, Mr. Gerious","Yousif, Mr. Wazli","Yousseff, Mr. Gerious","Zabour, Miss. Hileni","Zabour, Miss. Thamine","Zakarian, Mr. Mapriededer","Zakarian, Mr. Ortin","Zimmerman, Mr. Leo"
sex,female,male,female,male,female,male,female,male,female,male,...,male,female,male,male,male,female,female,male,male,male
age,29.0,0.92,2.0,30.0,25.0,48.0,63.0,39.0,53.0,71.0,...,27.0,15.0,45.5,NaN,NaN,14.5,NaN,26.5,27.0,29.0
sibsp,0,1,1,1,1,0,1,0,2,0,...,1,1,0,0,0,1,1,0,0,0
parch,0,2,2,2,2,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
ticket,24160,113781,113781,113781,113781,19952,13502,112050,11769,PC 17609,...,2659,2659,2628,2647,2627,2665,2665,2656,2670,315082
fare,211.3375,151.55,151.55,151.55,151.55,26.55,77.9583,0.0,51.4792,49.5042,...,14.4542,14.4542,7.225,7.225,14.4583,14.4542,14.4542,7.225,7.225,7.875
cabin,B5,C22 C26,C22 C26,C22 C26,C22 C26,E12,D7,A36,C101,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
embarked,S,S,S,S,S,S,S,S,S,C,...,C,C,C,C,C,C,C,C,C,S
boat,2,11,NaN,NaN,NaN,3,10,NaN,D,NaN,...,C,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
body,NaN,NaN,NaN,135.0,NaN,NaN,NaN,NaN,NaN,22.0,...,NaN,NaN,312.0,NaN,NaN,328.0,NaN,304.0,NaN,NaN
home.dest,"St Louis, MO","Montreal, PQ / Chesterville, ON","Montreal, PQ / Chesterville, ON","Montreal, PQ / Chesterville, ON","Montreal, PQ / Chesterville, ON","New York, NY","Hudson, NY","Belfast, NI","Bayside, Queens, NY","Montevideo, Uruguay",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# マージと連結(59 - 65)

In [4]:
# 【59】
# df2にdf3を左結合（結合キーはname）し、df2に格納
# print(ans[59]) #回答表示
df2 = initialize2() #初期化

df2 = pd.merge(df2, df3, on="name", how="left")
df2

  name  class  English  Mathematics  History  Biology  Physics
0    A      1       80           55       65     58.0    100.0
1    B      1       55          100       83      NaN      NaN
2    C      2       65           70       95     79.0     60.0
3    D      1       40           63       70     95.0     89.0
4    E      2       76           82       79      NaN      NaN
5    F      2       93           68       81     45.0     69.0
6    G      1      100           85       52      NaN      NaN
7    H      2       73           52       96      NaN      NaN
8    B      1       55          100       83      NaN      NaN
9    D      1       40           63       70     95.0     89.0

In [5]:
# 【60】
# df2にdf3を右結合し、df2に格納
#print(ans[60]) #回答表示
df2 = initialize2() #初期化

df2 = pd.merge(df2, df3, how="right")
df2

  name  class  English  Mathematics  History  Biology  Physics
0    A    1.0     80.0         55.0     65.0       58      100
1    C    2.0     65.0         70.0     95.0       79       60
2    D    1.0     40.0         63.0     70.0       95       89
3    D    1.0     40.0         63.0     70.0       95       89
4    F    2.0     93.0         68.0     81.0       45       69
5    I    NaN      NaN          NaN      NaN       63       91
6    J    NaN      NaN          NaN      NaN       87       76
7    K    NaN      NaN          NaN      NaN       73       83

In [7]:
# 【61】
# df2にdf3を内部結合し、df2に格納
# print(ans[61]) #回答表示
df2 = initialize2() #初期化

df2 = pd.merge(df2, df3, on="name", how="inner")
df2

  name  class  English  Mathematics  History  Biology  Physics
0    A      1       80           55       65       58      100
1    C      2       65           70       95       79       60
2    D      1       40           63       70       95       89
3    D      1       40           63       70       95       89
4    F      2       93           68       81       45       69

In [8]:
# 【62】
# df2にdf3を外部結合し、df2に格納
#print(ans[62]) #回答表示
df2 = initialize2() #初期化

df2 = pd.merge(df2, df3, on="name", how="outer")
df2

   name  class  English  Mathematics  History  Biology  Physics
0     A    1.0     80.0         55.0     65.0     58.0    100.0
1     B    1.0     55.0        100.0     83.0      NaN      NaN
2     B    1.0     55.0        100.0     83.0      NaN      NaN
3     C    2.0     65.0         70.0     95.0     79.0     60.0
4     D    1.0     40.0         63.0     70.0     95.0     89.0
5     D    1.0     40.0         63.0     70.0     95.0     89.0
6     E    2.0     76.0         82.0     79.0      NaN      NaN
7     F    2.0     93.0         68.0     81.0     45.0     69.0
8     G    1.0    100.0         85.0     52.0      NaN      NaN
9     H    2.0     73.0         52.0     96.0      NaN      NaN
10    I    NaN      NaN          NaN      NaN     63.0     91.0
11    J    NaN      NaN          NaN      NaN     87.0     76.0
12    K    NaN      NaN          NaN      NaN     73.0     83.0

In [10]:
# 【63】
# df2とdf4を列方向に連結し、df2に格納
# print(ans[63]) #回答表示
df2 = initialize2() #初期化

df2 = pd.concat([df2, df4], axis=1)
df2

  name  class  English  Mathematics  History name  Biology  Physics
0    A      1       80           55       65    A       58      100
1    B      1       55          100       83    B       80       63
2    C      2       65           70       95    C       79       60
3    D      1       40           63       70    D       95       89
4    E      2       76           82       79    E       68       55
5    F      2       93           68       81    F       45       69
6    G      1      100           85       52    G       52       68
7    H      2       73           52       96    H       89       70
8    B      1       55          100       83    B       61       64
9    D      1       40           63       70    D       95       89

In [12]:
# 【64】
# df2とdf4を列方向に連結後、重複している
# name列の片方を削除し、df2に格納
# print(ans[64]) #回答表示
df2 = initialize2() #初期化

df2 = pd.concat([df2, df4], axis=1)
df2 = df2.loc[:, ~df2.columns.duplicated()]
df2

  name  class  English  Mathematics  History  Biology  Physics
0    A      1       80           55       65       58      100
1    B      1       55          100       83       80       63
2    C      2       65           70       95       79       60
3    D      1       40           63       70       95       89
4    E      2       76           82       79       68       55
5    F      2       93           68       81       45       69
6    G      1      100           85       52       52       68
7    H      2       73           52       96       89       70
8    B      1       55          100       83       61       64
9    D      1       40           63       70       95       89

In [15]:
# 【65】
# df2とdf4を行方向に連結し、df2に格納
# print(ans[65]) #回答表示
df2 = initialize2() #初期化

df2 = pd.concat([df2, df4], axis=0)
df2

  name  class  English  Mathematics  History  Biology  Physics
0    A    1.0     80.0         55.0     65.0      NaN      NaN
1    B    1.0     55.0        100.0     83.0      NaN      NaN
2    C    2.0     65.0         70.0     95.0      NaN      NaN
3    D    1.0     40.0         63.0     70.0      NaN      NaN
4    E    2.0     76.0         82.0     79.0      NaN      NaN
5    F    2.0     93.0         68.0     81.0      NaN      NaN
6    G    1.0    100.0         85.0     52.0      NaN      NaN
7    H    2.0     73.0         52.0     96.0      NaN      NaN
8    B    1.0     55.0        100.0     83.0      NaN      NaN
9    D    1.0     40.0         63.0     70.0      NaN      NaN
0    A    NaN      NaN          NaN      NaN     58.0    100.0
1    B    NaN      NaN          NaN      NaN     80.0     63.0
2    C    NaN      NaN          NaN      NaN     79.0     60.0
3    D    NaN      NaN          NaN      NaN     95.0     89.0
4    E    NaN      NaN          NaN      NaN     68.0     55.0
5    F    NaN      NaN          NaN      NaN     45.0     69.0
6    G    NaN      NaN          NaN      NaN     52.0     68.0
7    H    NaN      NaN          NaN      NaN     89.0     70.0
8    B    NaN      NaN          NaN      NaN     61.0     64.0
9    D    NaN      NaN          NaN      NaN     95.0     89.0

# 統計 (66 - 79)

In [ ]:
# 【66】
# dfのage列の平均値を確認
#print(ans[66]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【67】
# dfのage列の中央値を確認
#print(ans[67]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【68】
# ①df2の生徒ごとの合計点（行方向の合計）
# ②df2の科目ごとの点数の総和（列方向の合計）
#print(ans[68]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【69】
# df2のEnglishで得点の最大値
#print(ans[69]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【70】
# df2のEnglishで得点の最小値
#print(ans[70]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【71】
# df2においてclassでグルーピングし、クラスごとの科目の
# 最大値、最小値、平均値を求める(name列は削除しておく)
#print(ans[71]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【72】
# dfの基本統計量を確認(describe)
#print(ans[72]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【73】
# dfの各列間の(Pearson)相関係数を確認
#print(ans[73]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【74】
# scikit-learnを用いてdf2のEnglish、Mathematics、History列を標準化する
# (from sklearn.preprocessing import StandardScalerをインポート)
#print(ans[74]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【75】
# scikit-learnを用いてdf2のEnglish列を標準化する
# (from sklearn.preprocessing import StandardScalerをインポート)
#print(ans[75]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【76】
# scikit-learnを用いてdf2のEnglish、Mathematics、History列を
# Min-Maxスケーリングする
# (from sklearn.preprocessing import StandardScalerをインポート)
#print(ans[76]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【77】
# dfのfare列の最大値、最小値の行名を取得
#print(ans[77]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【78】
# dfのfare列の0、25、50、75、100パーセンタイルを取得
#print(ans[78]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【79】
# ①dfのage列の最頻値を取得
# ②value_counts()にてage列の要素数を
# 確認し、①の結果の妥当性を確認
#print(ans[79]) #回答表示
df = initialize1() #初期化

# ラベリング (80 - 81)

In [ ]:
# 【80】
# dfのsex列をラベルエンコーディングし、
# dfの先頭5行を表示
# (from sklearn.preprocessing import LabelEncoderをインポート)
#print(ans[80]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【81】
# dfのsex列をOne-hotエンコーディングし、
# dfの先頭5行を表示
#print(ans[81]) #回答表示
df = initialize1() #初期化

# Pandasプロット (82 - 89)
Pandasプロットの機能については以下のサイトの説明が分かりやすいです  
[自調自考の旅](https://own-search-and-study.xyz/2016/08/03/pandas%E3%81%AEplot%E3%81%AE%E5%85%A8%E5%BC%95%E6%95%B0%E3%82%92%E4%BD%BF%E3%81%84%E3%81%93%E3%81%AA%E3%81%99/)

In [ ]:
# 【82】
# dfのすべての数値列のヒストグラムを表示
#print(ans[82]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【83】
# dfのage列をヒストグラムで表示
#print(ans[83]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【84】
# df2のname列の要素ごとの3科目合計得点を棒グラフで表示
#print(ans[84]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【85】
# df2のname列の要素ごとの3科目を棒グラフで
# 並べて表示
#print(ans[85]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【86】
# df2のname列の要素ごとの3科目を積み上げ棒グラフで表示
#print(ans[86]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【87】
# dfの各列間の散布図を表示
# (from pandas.plotting import scatter_matrixをインポート)
#print(ans[87]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【88】
# dfのage列とfare列で散布図を作成
#print(ans[88]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【89】
# 【88】で描画したグラフに「age-fare scatter」という
# グラフタイトルをつける
#print(ans[89]) #回答表示
df = initialize1() #初期化

# タイタニック号の生存者予測 (90 - 100)  
これまで触れてきたタイタニック号の乗客データを使用して、乗客の生存有無を  
予測してみます。  
  
※90～100については順番通りにやらないと上手く動作しません

In [ ]:
# 【90】ラベルエンコーディング
# df_copyのsexとembarked列をラベルエンコーディング
# (from sklearn.preprocessing import LabelEncoderをインポート)
# (df_copyはdfをコピーしたもの)
#print(ans[90]) #回答表示
df_copy =df.copy()

In [ ]:
# 【91】欠損値確認
# df_copyの欠損値を確認
#print(ans[91]) #回答表示

In [ ]:
# 【92】欠損値補完
# df_copyのage、fare列の欠損値を各列の平均値で補完
#print(ans[92]) #回答表示

In [ ]:
# 【93】不要列の削除
# df_copyの中で機械学習で使用しない不要な行を削除
# (name, ticket, cabin, boat, body, home.destを削除)
#print(ans[93]) #回答表示

In [ ]:
# 【94】ndarray形式への変換
# ①df_copyのpclass、age、sex、fare、embarkedの列を抽出し、ndarray形式に変換
# ②df_copyのsurvivedの列を抽出し、ndarray形式に変換
# (①をfeatures、②をtargetという変数にそれぞれ格納)
#print(ans[94]) #回答表示

In [ ]:
# 【95】学習データとテストデータに分割
# 【94】で作成したfeatrues、targetを学習データとテストデータに分割
# (from sklearn.model_selection import  train_test_splitをインポート)
# ※分割時のパラメータは次を指定 test_size=0.3 random_state=0
#print(ans[95]) #回答表示

In [ ]:
# 【96】学習の実行
# 学習データ(features、target)を用いランダムフォレストにて学習を実行
# (from sklearn.ensemble import RandomForestClassifierをインポート)
# ※パラメータは次を指定 n_estimators=100 random_state=0
#print(ans[96]) #回答表示

In [ ]:
# 【97】予測の実行
# test_Xデータの乗客の生存を予測
#print(ans[97]) #回答表示

In [ ]:
# 【98】予測精度の確認
# 予測結果がtest_y(生存有無の答え)とどれぐらい
# 整合していたかを確認(評価指標はaccuracy)
# (from sklearn.metrics import accuracy_scoreをインポート)
#print(ans[98]) #回答表示

In [ ]:
# 【99】重要度の確認
# 学習における各列(特徴量)の
# 重要度を表示
#print(ans[99]) #回答表示

In [ ]:
# 【100】予測結果のcsv出力
# test_Xの予測結果をcsvでoutputフォルダに出力(ファイル名は「submission.csv」)
# (headerは不要)
#print(ans[100]) #回答表示

# ノックお疲れ様でした
各セルのoutput表示をすべてクリアにしたい場合は、ツールバーの  
「Kernel」→「Restart & Clear Output」を実行して下さい。